In [56]:
import numpy as np
import pandas as pd

In [57]:
# creating a dataframe
df = pd.DataFrame(
    {
    "Name":["ammar", "mohammed", "salma"],
    "Age":[18, 26, 20],
    "Gender":["male", "male", "female"]
    }
) 
df

       Name  Age  Gender
0     ammar   18    male
1  mohammed   26    male
2     salma   20  female

In [58]:
# accessing a df
print(df["Age"])
highest_age = df["Age"].max()
highest_age_index = df["Age"].idxmax()
highest_age_person = df.loc[highest_age_index, "Name"]
print(f"highest age is {highest_age_person} with {highest_age}")

0    18
1    26
2    20
Name: Age, dtype: int64
highest age is mohammed with 26

In [59]:
# creating and adding a column to a dataframe
score = pd.Series([95, 100, 80], name = "Score")
df["Score"] = score
df

       Name  Age  Gender  Score
0     ammar   18    male     95
1  mohammed   26    male    100
2     salma   20  female     80

In [60]:
# creating and adding a row to a dataframe
s = pd.Series({"Name": "Abdullah", "Age":29, "Gender":"male", "Score":90})
df = pd.concat([df, s.to_frame().T], ignore_index=True)
df

       Name Age  Gender Score
0     ammar  18    male    95
1  mohammed  26    male   100
2     salma  20  female    80
3  Abdullah  29    male    90

In [61]:
# creating a df with random values
frame = pd.DataFrame(np.random.randn(1000, 5), columns=["a", "b", "c", "d", "e"])
frame

            a         b         c         d         e
0    0.668086 -0.705939 -0.094910 -1.609851 -1.050941
1   -1.681801  0.486890  2.373823  1.186647 -0.014753
2    1.008912 -0.382559  0.504818 -1.023388  0.035081
3    0.057037  1.248866  0.035509 -0.222856 -1.164689
4   -0.005729 -1.012864 -0.448959 -1.333027 -0.329337
..        ...       ...       ...       ...       ...
995  1.740595 -1.686422  0.971542 -0.321509  0.855338
996 -1.975032 -0.837280  0.473349  2.281429  0.410454
997 -0.653291  2.057619 -1.607522  0.132154 -1.224172
998  1.518009  1.246499  0.448382  0.614667  1.054515
999 -0.439707 -0.347297 -0.841754 -0.471545  0.271682

[1000 rows x 5 columns]

In [62]:
# finding basic statistics of numerical data in the dataframe
frame.describe()

                 a            b            c            d            e
count  1000.000000  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.009416     0.002029     0.016281     0.009815     0.046189
std       1.011562     0.994254     1.019528     0.989541     1.023402
min      -3.125171    -2.936323    -3.175152    -3.249068    -3.445557
25%      -0.668868    -0.674944    -0.645336    -0.613226    -0.652817
50%       0.015505    -0.015574     0.025095     0.004504     0.052962
75%       0.687170     0.719773     0.672856     0.688970     0.738795
max       4.225222     3.016625     3.259627     2.995718     3.580739

In [63]:
# finding basic statistics of non numerical data in the dataframe
df.describe()

         Name  Age Gender  Score
count       4    4      4      4
unique      4    4      2      4
top     ammar   18   male     95
freq        1    1      3      1

In [66]:
# exporting dataframe to a csv file
df.to_csv("data/people.csv", index=False)

In [69]:
# reading dataframe from a csv file
titanic = pd.read_csv("data/titanic.csv")
titanic

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q